# <center> Cross Tab | Assignment 3

#### Loading dependencies

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

#### Loading the dataset

In [2]:
data = pd.read_csv('./cross_tab.csv')

#### Viewing the dataframe

In [3]:
data.head()

   Unnamed: 0    Product Region Salesperson  Sales
0           0  Product C   West       David    502
1           1  Product A   West       Alice    445
2           2  Product C   West     Charlie    610
3           3  Product C   East         Bob    246
4           4  Product A   East       Alice    247

In [4]:
data.tail()

    Unnamed: 0    Product Region Salesperson  Sales
95          95  Product A  South     Charlie    662
96          96  Product A   East       David    537
97          97  Product C   West       David    875
98          98  Product A  South     Charlie    382
99          99  Product A   East       David    126

In [5]:
data.sample(5)

    Unnamed: 0    Product Region Salesperson  Sales
68          68  Product B   East       David    819
52          52  Product B   East         Bob    203
57          57  Product A   East       David    609
44          44  Product A  South       Alice    153
45          45  Product C   East       Alice    219

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   100 non-null    int64
 1   Product      100 non-null    object
 2   Region       100 non-null    object
 3   Salesperson  100 non-null    object
 4   Sales        100 non-null    int64
dtypes: int64(2), object(3)
memory usage: 4.0+ KB

In [7]:
data.describe()

       Unnamed: 0       Sales
count  100.000000  100.000000
mean    49.500000  548.170000
std     29.011492  271.297148
min      0.000000  101.000000
25%     24.750000  303.750000
50%     49.500000  529.000000
75%     74.250000  769.750000
max     99.000000  996.000000

#### Null percentage

In [8]:
data.isnull().mean()*100

Unnamed: 0     0.0
Product        0.0
Region         0.0
Salesperson    0.0
Sales          0.0
dtype: float64

#### Checking for duplicates

In [9]:
data.duplicated().sum()

0

#### Calling the columns

In [10]:
data.columns

Index(['Unnamed: 0', 'Product', 'Region', 'Salesperson', 'Sales'], dtype='object')

In [11]:
data["Unnamed: 0"]

0      0
1      1
2      2
3      3
4      4
      ..
95    95
96    96
97    97
98    98
99    99
Name: Unnamed: 0, Length: 100, dtype: int64

#### Dropping the columns

In [12]:
data.drop(columns='Unnamed: 0', inplace=True)

In [13]:
data.head()

     Product Region Salesperson  Sales
0  Product C   West       David    502
1  Product A   West       Alice    445
2  Product C   West     Charlie    610
3  Product C   East         Bob    246
4  Product A   East       Alice    247

#### Replace

In [14]:
data.Product.replace({"Product A" :'A',"Product B":'B',"Product C":'C'},inplace=True)

## Questions | CROSSTAB ASSIGNMENT

1. Calculate the total sales for each combination of Product and Region
2. Find the average sales per salesperson for each product.
3. Count the number of sales transactions for each region and product. 
4. Determine the maximum sales value for each region and salesperson combination.
5. Create a cross-tab that shows both the total sales and the average sales for each product and region combination.

## Solutions

#### Answer 1

In [15]:
Total_sales = pd.crosstab(index=data['Region'], columns=data['Product'], values=data['Sales'], aggfunc='sum')
Total_sales

Product     A     B     C
Region
East     5434  7005  5889
North    4296  4575  4151
South    4350  3425  1135
West     4769  5201  4587

#### Answer 2

In [16]:
data['Salesperson'].nunique()

4

In [17]:
Average_sales_per_salesperson = pd.crosstab(index=data['Salesperson'], columns=data['Product'], values=data['Sales'], aggfunc='mean')
Average_sales_per_salesperson

Product               A           B           C
Salesperson
Alice        509.888889  614.000000  419.666667
Bob          447.000000  513.333333  587.666667
Charlie      658.714286  604.272727  401.400000
David        652.000000  487.571429  586.545455

#### Answer 3

In [18]:
Sales_transactions = pd.crosstab(index=data['Region'], columns=data['Product'], values=data['Sales'], aggfunc='count')
Sales_transactions

Product  A   B   C
Region
East     9  13  12
North    6   8   8
South    9   7   3
West     9   8   8

#### Answer 4

In [19]:
Max_sales = pd.crosstab(index=data['Region'], columns=data['Salesperson'], values=data['Sales'], aggfunc='max')
Max_sales

Salesperson  Alice  Bob  Charlie  David
Region
East           963  995      980    915
North          977  960      787    982
South          474  739      740    951
West           863  996      919    875

#### Answer 5

In [20]:
Total_and_Average_sales = pd.crosstab(data['Product'], data['Region'], values=data['Sales'], aggfunc=['sum','mean'])
Total_and_Average_sales

          sum                          mean
Region   East North South  West        East    North       South        West
Product
A        5434  4296  4350  4769  603.777778  716.000  483.333333  529.888889
B        7005  4575  3425  5201  538.846154  571.875  489.285714  650.125000
C        5889  4151  1135  4587  490.750000  518.875  378.333333  573.375000